package com.example.lenguyenminhtam.ie209j1_project;
import android.content.ContentValues;
import android.database.sqlite.SQLiteOpenHelper;

import android.database.sqlite.SQLiteDatabase;
import android.content.Context;
public class DatabaseHocSinhHelper extends SQLiteOpenHelper {
    public static final String DATABASE_NAME = "quanlyhocsinh";
    public static final String hocsinh = "hocsinh";
    public static final String MSHS = "MSHS";
    public static final String HoTenHS = "HoTenHS";
    public static final String GioiTinh = "GioiTinh";
    public static final String NgaySinh = "NgaySinh";
    public static final String DiaChi = "DiaChi";
    public static final String Email = "Email";
    public static final String Malop = "Malop";
    //thuộc tính chung malop
    public static final String lop = "lop";
    public static final String TenLop = "TenLop";
    public static final String SiSo = "SiSo";
    public static final String NamHoc = "NamHoc";

    public static final String loaidiem = "loaidiem";
    public static final String MaLoaiDiem = "MaLoaiDiem";
    public static final String TenLoaiDiem = "TenLoaiDiem";

    public static final String monhoc = "monhoc";
    public static final String MaMonHoc = "MaMonHoc";
    public static final String TenMonHoc = "TenMonHoc";

    public static final String ketquahoctap = "ketquahoctap";
    public static final String MaKQHT = "MaKQHT";
    public static final String HocKy = "HocKY";
    //thuộc tính namhoc và mshs ở bảng khác
    public static final String TBCacMon = "TBCacMon";

    public static final String chitietketqua = "chitietketqua";
    public static final String MaCTKQ = "MaCTKQ";
    //thuộc tính MaKQHT ở bảng ketquahoctap, MaMonHoc ở monhoc, MaLoaiDiem ở loaidiem
    public static final String DiemSo = "DiemSo";

    public DatabaseHocSinhHelper(Context context) {
        super(context, DATABASE_NAME, null, 1);
        SQLiteDatabase db = this.getWritableDatabase();
    }

    @Override

    public void onCreate(SQLiteDatabase db) {
        String create_table_hocsinh = String.format("CREATE TABLE IF NOT EXISTS hocsinh ('MSHS' bigint(20) NOT NULL, " +
                "'HoTenHS' varchar(100)NOT NULL, 'GioiTinh' varchar(5) NOT NULL, 'NgaySinh' date NOT NULL," +
                "'DiaChi' varchar(100) NOT NULL, 'Email' varchar(100) NOT NULL, 'MaLop' bigint(20) NOT NULL," +
                "PRIMARY KEY ('MSHS')),KEY 'MaLop' ('MaLop') ENGINE=InnoDB DEFAULT CHARSET=utf8;");
        String create_table_lop = String.format("CREATE TABLE IF NOT EXISTS lop ('MaLop' bigint(20) NOT NULL, \" +\n" +
                "                \"'TenLop' varchar(20)NOT NULL, 'SiSo' int(11) NOT NULL, 'NamHoc' varchar(15) NOT NULL,\" +\n" +
                "                 \"PRIMARY KEY ('MaLop')) ENGINE=InnoDB DEFAULT CHARSET=utf8;");
        String insert_hocsinh = String.format("INSERT INTO `hocsinh` (`MSHS`, `HoTenHS`, `GioiTinh`, `NgaySinh`, `DiaChi`, `Email`, `MaLop`) VALUES\n" +
                "(1610101, 'Hoàng Bảo Anh', 'Nữ', '1996-12-04', '123/3 đường Lê Lợi, phường Bến Nghé, Quận 1, thành phố Hồ Chí Minh', '1610101@gmail.com', 16101),\n" +
                "(1610102, 'Nguyễn Bảo Anh', 'Nữ', '1996-06-06', '123/5B đường Lê Lợi, phường 6, thành phố Tuy Hòa, tỉnh Phú Yên', '1610102@gmail.com', 16101),\n" +
                "(1610103, 'Trần Ngọc Bảo', 'Nữ', '1996-08-12', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610103@gmail.com', 16101),\n" +
                "(1610104, 'Nguyễn Thanh Bình', 'Nam', '1996-09-23', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610104@gmail.com', 16101),\n" +
                "(1610105, 'Nguyễn Ngọc Hải', 'Nam', '1996-03-12', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610105@gmail.com', 16101),\n" +
                "(1610106, 'Nguyện Đình Hùng', 'Nam', '1996-05-22', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610106@gmail.com', 16101),\n" +
                "(1610107, 'Lưu Bảo Ly', 'Nữ', '1996-07-12', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610107@gmail.com', 16101),\n" +
                "(1610108, 'Nguyễn Thanh Nga', 'Nữ', '1996-06-20', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610108@gmail.com', 16101),\n" +
                "(1610109, 'Nguyễn Bảo Ngọc', 'Nữ', '1996-06-16', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610109@gmail.com', 16101),\n" +
                "(1610110, 'Nguyễn Thanh Sang', 'Nam', '1996-06-29', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610110@gmail.com', 16101),\n" +
                "(1610111, 'Nguyễn Đình Tâm', 'Nam', '1996-06-10', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610111@gmail.com', 16101),\n" +
                "(1610112, 'Hoàng Anh Thư', 'Nữ', '1996-06-06', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610112@gmail.com', 16101),\n" +
                "(1610113, 'Phạm Thanh Thùy', 'Nữ', '1996-06-20', 'Đội 3 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610113@gmail.com', 16101),\n" +
                "(1610114, 'Trần Đình Tùng', 'Nam', '1996-06-14', 'Đội 4 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610114@gmail.com', 16101),\n" +
                "(1610115, 'Phạm Kỳ Vĩ', 'Nam', '1996-06-18', 'Đội 4 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610115@gmail.com', 16101),\n" +
                "(1610201, 'Hoàng Bảo Anh', 'Nam', '1996-05-12', 'Đội 4 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610201@gmail.com', 16102),\n" +
                "(1610202, 'Nguyễn Bảo Anh', 'Nam', '1996-04-23', 'Đội 4 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên', '1610202@gmail.com', 16102),\n" +
                "(1610203, 'Trần Ngọc Bảo', 'Nữ', '1996-03-25', 'Đội 5 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610203@gmail.com', 16102),\n" +
                "(1610204, 'Nguyễn Đình Hùng', 'Nam', '1996-07-12', 'Đội 5 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610204@gmail.com', 16102),\n" +
                "(1610205, 'Lưu Bảo Ly', 'Nữ', '1996-09-23', 'Đội 5 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610205@gmail.com', 16102),\n" +
                "(1610206, 'Trần Anh Minh', 'Nữ', '1996-05-03', 'Đội 5 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610206@gmail.com', 16102),\n" +
                "(1610207, 'Trần Ngọc Minh', 'Nữ', '1996-04-19', 'Đội 5 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610207@gmail.com', 16102),\n" +
                "(1610208, 'Trần Thanh Minh', 'Nam', '1996-03-25', 'Đội 5 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610208@gmail.com', 16102),\n" +
                "(1610209, 'Nguyễn Thanh Sang', 'Nam', '1996-07-13', 'Đội 5 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610209@gmail.com', 16102),\n" +
                "(1610210, 'Hoàng Anh Thư', 'Nữ', '1996-09-19', 'Đội 5 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610210@gmail.com', 16102),\n" +
                "(1610211, 'Phạm Thanh Thùy', 'Nữ', '1996-05-26', 'Đội 5 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610211@gmail.com', 16102),\n" +
                "(1610212, 'Nguyễn Minh Trí', 'Nam', '1996-04-03', 'Đội 6 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610212@gmail.com', 16102),\n" +
                "(1610213, 'Phạm Minh Trí', 'Nam', '1996-03-15', 'Đội 6 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610213@gmail.com', 16102),\n" +
                "(1610214, 'Trần Đình Tùng', 'Nam', '1996-07-20', 'Đội 6 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610214@gmail.com', 16102),\n" +
                "(1610215, 'Phạm Kỳ Vĩ', 'Nam', '1996-04-03', 'Đội 7 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1610315@gmail.com', 16102),\n" +
                "(1611101, 'Lưu Bảo Ly', 'Nữ', '1995-03-15', 'Đội 7 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611101@gmail.com', 16111),\n" +
                "(1611102, 'Hoàng Anh Thư', 'Nữ', '1995-07-20', 'Đội 7 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611102@gmail.com', 16111),\n" +
                "(1611103, 'Nguyễn Bảo Anh', 'Nam', '1995-09-10', 'Đội 7 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611103@gmail.com', 16111),\n" +
                "(1611104, 'Nguyễn Thanh Bình', 'Nam', '1995-03-12', 'Đội 7 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611104@gmail.com', 16111),\n" +
                "(1611105, 'Nguyễn Ngọc Hải', 'Nam', '1995-05-22', 'Đội 7 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611105@gmail.com', 16111),\n" +
                "(1611106, 'Nguyện Đình Hùng', 'Nam', '1995-07-12', 'Đội 7 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611106@gmail.com', 16111),\n" +
                "(1611107, 'Nguyễn Đình Tâm', 'Nam', '1995-06-20', 'Đội 7 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611107@gmail.com', 16111),\n" +
                "(1611108, 'Nguyễn Bảo Ngọc', 'Nữ', '1995-06-16', 'Đội 1 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611108@gmail.com', 16111),\n" +
                "(1611109, 'Phạm Minh Minh', 'Nam', '1995-06-29', 'Đội 1 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611109@gmail.com', 16111),\n" +
                "(1611110, 'Hoàng Kim Thư', 'Nữ', '1995-06-10', 'Đội 1 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611110@gmail.com', 16111),\n" +
                "(1611111, 'Hoàng Bảo Anh', 'Nữ', '1995-06-06', 'Đội 1 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611111@gmail.com', 16111),\n" +
                "(1611112, 'Nguyễn Minh Anh', 'Nam', '1995-06-20', 'Đội 1 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611112@gmail.com', 16111),\n" +
                "(1611113, 'Nguyễn Thị Thủy', 'Nữ', '1995-06-14', 'Đội 1 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611113@gmail.com', 16111),\n" +
                "(1611114, 'Thái Ngọc Bảo', 'Nữ', '1995-07-20', 'Đội 1 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611114@gmail.com', 16111),\n" +
                "(1611115, 'Trần Anh Thi', 'Nam', '1995-09-10', 'Đội 1 thôn Phú Lợi, xã Hòa An, huyện Phú Hòa, tỉnh Phú Yên.', '1611115@gmail.com', 16111),\n" +
                "(1611201, 'Lê Ngọc Trâm', 'Nữ', '1995-01-12', '550, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611116@gmail.com', 16112),\n" +
                "(1611202, 'Nguyễn Hồng Ngọc', 'Nữ', '1995-01-13', '120, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611117@gmail.com', 16112),\n" +
                "(1611203, 'Lê Trần Ngọc Hoàng', 'Nữ', '1995-06-14', '292, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611118@gmail.com', 16112),\n" +
                "(1611204, 'Lê Thị Hân', 'Nữ', '1995-03-15', '555, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611119@gmail.com', 16112),\n" +
                "(1611205, 'Trần Thị Mỹ Hân', 'Nữ', '1995-02-16', '335, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611120@gmail.com', 16112),\n" +
                "(1611206, 'Trần Thị Châu', 'Nữ', '1995-01-17', '125, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611121@gmail.com', 16112),\n" +
                "(1611207, 'Trần Duyên Ánh Tuyết', 'Nữ', '1995-08-18', '454, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611122@gmail.com', 16112),\n" +
                "(1611208, 'Nguyễn Thị Hoàng Mỹ', 'Nữ', '1995-01-19', '551, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611123@gmail.com', 16112),\n" +
                "(1611209, 'Nguyễn Mạnh Hùng', 'Nam', '1995-08-20', '201, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611124@gmail.com', 16112),\n" +
                "(1611210, 'Lê Công Minh', 'Nam', '1995-07-21', '103, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611125@gmail.com', 16112),\n" +
                "(1611211, 'Nguyễn Dương Hải', 'Nam', '1995-06-22', '559, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611126@gmail.com', 16112),\n" +
                "(1611212, 'Nguyễn Trần Trung Hậu', 'Nam', '1995-10-23', '569, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611127@gmail.com', 16112),\n" +
                "(1611213, 'Lê Bảo Trung', 'Nam', '1995-01-24', '378, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611128@gmail.com', 16112),\n" +
                "(1611214, 'Trần Thị Ngọc Hạnh', 'Nữ', '1995-04-25', '1001B, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1611129@gmail.com', 16112),\n" +
                "(1611215, 'Trần Hoàng Nam', 'Nam', '1995-11-12', '900A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1611130@gmail.com', 16112),\n" +
                "(1612101, 'Lê Ngọc Hoàng', 'Nữ', '1994-01-12', '550, Tỉnh lộ 43, quận Thủ Đức, thành phố Hồ Chí Minh', '1511101@gmail.com', 16121),\n" +
                "(1612102, 'Nguyễn Ngọc Kim', 'Nữ', '1994-01-13', '900A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511102@gmail.com', 16121),\n" +
                "(1612103, 'Lê Nguyễn Ngọc Hạnh', 'Nữ', '1994-01-14', '901A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511103@gmail.com', 16121),\n" +
                "(1612104, 'Lê Thị Dung', 'Nữ', '1994-01-15', '902A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511104@gmail.com', 16121),\n" +
                "(1612105, 'Trần Thị Mỹ Hân', 'Nữ', '1994-01-16', '903A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511105@gmail.com', 16121),\n" +
                "(1612106, 'Trần Thị Châu', 'Nữ', '1994-01-17', '904A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511106@gmail.com', 16121),\n" +
                "(1612107, 'Trần Duyên Ánh', 'Nữ', '1994-01-18', '905A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511107@gmail.com', 16121),\n" +
                "(1612108, 'Nguyễn Thị Hoàng Mỹ', 'Nữ', '1994-01-19', '906A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511108@gmail.com', 16121),\n" +
                "(1612109, 'Nguyễn Mạnh Hoàn', 'Nam', '1994-01-20', '907A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511109@gmail.com', 16121),\n" +
                "(1612110, 'Nguyễn Công Minh', 'Nam', '1994-01-21', '908A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511110@gmail.com', 16121),\n" +
                "(1612111, 'Nguyễn Dương Sỹ', 'Nam', '1994-01-22', '908A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511111@gmail.com', 16121),\n" +
                "(1612112, 'Nguyễn Trần Trung Quân', 'Nam', '1994-01-23', '909A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511112@gmail.com', 16121),\n" +
                "(1612113, 'Lê Bảo Triều', 'Nam', '1994-01-24', '910A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511113@gmail.com', 16121),\n" +
                "(1612114, 'Lê Thị Ngọc Châu', 'Nữ', '1994-01-25', '911A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511114@gmail.com', 16121),\n" +
                "(1612115, 'Lê Trần Thái Minh', 'Nam', '1994-09-22', '912A, đường quốc lộ 1A, p. Bình Hưng Hòa, quận Bình Tân, thành phố Hồ Chí Minh', '1511115@gmail.com', 16121),\n" +
                "(1612201, 'Trần Ngọc Mỹ Dung', 'Nữ', '1994-04-20', '48 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511116@gmail.com', 16122),\n" +
                "(1612202, 'Nguyễn Ngọc Ánh', 'Nữ', '1994-01-13', '49 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511117@gmail.com', 16122),\n" +
                "(1612203, 'Lê Nguyễn Mỹ Hạnh', 'Nữ', '1994-10-24', '50 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511118@gmail.com', 16122),\n" +
                "(1612204, 'Lê Kim Dung', 'Nữ', '1994-11-15', '51 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511119@gmail.com', 16122),\n" +
                "(1612205, 'Trần Thị Hồng ', 'Nữ', '1994-11-06', '52 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511120@gmail.com', 16122),\n" +
                "(1612206, 'Trần Thị Ngọc Ánh', 'Nữ', '1994-01-17', '53 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511121@gmail.com', 16122),\n" +
                "(1612207, 'Trần Cao Hồng Ngọc', 'Nữ', '1994-01-18', '54 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511122@gmail.com', 16122),\n" +
                "(1612208, 'Nguyễn Thị Ngọc Tuyết', 'Nữ', '1994-01-19', '55 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511123@gmail.com', 16122),\n" +
                "(1612209, 'Nguyễn Trần Hải Triều', 'Nam', '1994-01-20', '56 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511124@gmail.com', 16122),\n" +
                "(1612210, 'Nguyễn Hải Minh', 'Nam', '1994-01-21', '57 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511125@gmail.com', 16122),\n" +
                "(1612211, 'Nguyễn Văn Sỹ', 'Nam', '1994-09-19', '58 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511126@gmail.com', 16122),\n" +
                "(1612212, 'Nguyễn Trần Minh Tú', 'Nam', '1994-11-19', '59 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511127@gmail.com', 16122),\n" +
                "(1612213, 'Lê Hoàng Thái', 'Nam', '1994-12-02', '60 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511128@gmail.com', 16122),\n" +
                "(1612214, 'Lê Thị Trang', 'Nữ', '1994-10-10', '61 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511129@gmail.com', 16122),\n" +
                "(1612215, 'Lê Trọng Hoàng', 'Nam', '1994-12-08', '62 Đặng Văn Bi, Bình Thọ, Thủ Đức, Hồ Chí Minh', '1511130@gmail.com', 16122);");
        String insert_lop = String.format("INSERT INTO `lop` (`MaLop`, `TenLop`, `SiSo`, `NamHoc`) VALUES\n" +
                "(16101, '10A', 3, '2016 - 2017'),\n" +
                "(16102, '10B', 3, '2016 - 2017'),\n" +
                "(16111, '11A', 3, '2016 - 2017'),\n" +
                "(16112, '11B', 3, '2016 - 2017'),\n" +
                "(16121, '12A', 3, '2016 - 2017'),\n" +
                "(16122, '12B', 3, '2016 - 2017');");
        String create_table_loaidiem = String.format("CREATE TABLE IF NOT EXISTS `loaidiem` (\n" +
                "  `MaLoaiDiem` bigint(20) NOT NULL,\n" +
                "  `TenLoaiDiem` varchar(100) CHARACTER SET utf8mb4 NOT NULL,\n" +
                "  PRIMARY KEY (`MaLoaiDiem`)\n" +
                ") ENGINE=InnoDB DEFAULT CHARSET=utf8;");
        String insert_loaidiem = String.format("INSERT INTO `loaidiem` (`MaLoaiDiem`, `TenLoaiDiem`) VALUES\n" +
                "(401, 'Miệng'),\n" +
                "(402, '15 phút'),\n" +
                "(403, '1 tiết'),\n" +
                "(404, 'Học kỳ');");
        String create_table_monhoc = String.format("CREATE TABLE IF NOT EXISTS `monhoc` (\n" +
                "  `MaMonHoc` bigint(20) NOT NULL,\n" +
                "  `TenMonHoc` varchar(100) NOT NULL,\n" +
                "  PRIMARY KEY (`MaMonHoc`)\n" +
                ") ENGINE=InnoDB DEFAULT CHARSET=utf8;");
        String insert_monhoc = String.format("INSERT INTO `monhoc` (`MaMonHoc`, `TenMonHoc`) VALUES\n" +
                "(501, 'Toán'),\n" +
                "(502, 'Lý'),\n" +
                "(503, 'Hóa'),\n" +
                "(504, 'Ngữ văn'),\n" +
                "(505, 'Tiếng Anh');");
        String create_table_ketquahoctap = String.format("CREATE TABLE IF NOT EXISTS `ketquahoctap` (\n" +
                "  `MaKQHT` bigint(20) NOT NULL,\n" +
                "  `MSHS` bigint(20) NOT NULL,\n" +
                "  `HocKy` varchar(5) NOT NULL,\n" +
                "  `NamHoc` varchar(15) NOT NULL,\n" +
                "  `TBCacMon` float NOT NULL,\n" +
                "  PRIMARY KEY (`MaKQHT`),\n" +
                "  KEY `MSHS` (`MSHS`)\n" +
                ") ENGINE=InnoDB DEFAULT CHARSET=utf8;");
        String insert_ketquahoctap = String.format("INSERT INTO `ketquahoctap` (`MaKQHT`, `MSHS`, `HocKy`, `NamHoc`, `TBCacMon`) VALUES\n" +
                "(11610101, 1610101, 'HK1', '2016 - 2017', 0),\n" +
                "(11610102, 1610102, 'HK1', '2016 - 2017', 0),\n" +
                "(11610103, 1610103, 'HK1', '2016 - 2017', 0),\n" +
                "(11610201, 1610201, 'HK1', '2016 - 2017', 0),\n" +
                "(11610202, 1610202, 'HK1', '2016 - 2017', 0),\n" +
                "(11610203, 1610203, 'HK1', '2016 - 2017', 0),\n" +
                "(11611101, 1611101, 'HK1', '2016 - 2017', 0),\n" +
                "(11611102, 1611102, 'HK1', '2016 - 2017', 0),\n" +
                "(11611103, 1611103, 'HK1', '2016 - 2017', 0),\n" +
                "(11611201, 1611201, 'HK1', '2016 - 2017', 0),\n" +
                "(11611202, 1611202, 'HK1', '2016 - 2017', 0),\n" +
                "(11611203, 1611203, 'HK1', '2016 - 2017', 0),\n" +
                "(11612101, 1612101, 'HK1', '2016 - 2017', 0),\n" +
                "(11612102, 1612102, 'HK1', '2016 - 2017', 0),\n" +
                "(11612103, 1612103, 'HK1', '2016 - 2017', 0),\n" +
                "(11612201, 1612201, 'HK1', '2016 - 2017', 0),\n" +
                "(11612202, 1612202, 'HK1', '2016 - 2017', 0),\n" +
                "(11612203, 1612203, 'HK1', '2016 - 2017', 0),\n" +
                "(21610101, 1610101, 'HK2', '2016 - 2017', 0),\n" +
                "(21610102, 1610102, 'HK2', '2016 - 2017', 0),\n" +
                "(21610103, 1610103, 'HK2', '2016 - 2017', 0),\n" +
                "(21610201, 1610201, 'HK2', '2016 - 2017', 0),\n" +
                "(21610202, 1610202, 'HK2', '2016 - 2017', 0),\n" +
                "(21610203, 1610203, 'HK2', '2016 - 2017', 0),\n" +
                "(21611101, 1611101, 'HK2', '2016 - 2017', 0),\n" +
                "(21611102, 1611102, 'HK2', '2016 - 2017', 0),\n" +
                "(21611103, 1611103, 'HK2', '2016 - 2017', 0),\n" +
                "(21611201, 1611201, 'HK2', '2016 - 2017', 0),\n" +
                "(21611202, 1611202, 'HK2', '2016 - 2017', 0),\n" +
                "(21611203, 1611203, 'HK2', '2016 - 2017', 0),\n" +
                "(21612101, 1612101, 'HK2', '2016 - 2017', 0),\n" +
                "(21612102, 1612102, 'HK2', '2016 - 2017', 0),\n" +
                "(21612103, 1612103, 'HK2', '2016 - 2017', 0),\n" +
                "(21612201, 1612201, 'HK2', '2016 - 2017', 0),\n" +
                "(21612202, 1612202, 'HK2', '2016 - 2017', 0),\n" +
                "(21612203, 1612203, 'HK2', '2016 - 2017', 0);");
        String create_table_chitietketqua = String.format("CREATE TABLE IF NOT EXISTS `chitietketqua` (\n" +
                "  `MaCTKQ` bigint(20) NOT NULL,\n" +
                "  `MaKQHT` bigint(20) NOT NULL,\n" +
                "  `MaMonHoc` bigint(20) NOT NULL,\n" +
                "  `MaLoaiDiem` bigint(20) NOT NULL,\n" +
                "  `DiemSo` float NOT NULL,\n" +
                "  PRIMARY KEY (`MaCTKQ`),\n" +
                "  KEY `MaKQHT` (`MaKQHT`),\n" +
                "  KEY `MaLoaiDiem` (`MaLoaiDiem`),\n" +
                "  KEY `MaMonHoc` (`MaMonHoc`)\n" +
                ") ENGINE=InnoDB DEFAULT CHARSET=utf8;");
        String insert_chitietketqua = String.format("INSERT INTO `chitietketqua` (`MaCTKQ`, `MaKQHT`, `MaMonHoc`, `MaLoaiDiem`, `DiemSo`) VALUES\n" +
                "(1161010101, 11610101, 501, 401, 7),\n" +
                "(1161010102, 11610101, 501, 402, 8),\n" +
                "(1161010103, 11610101, 501, 403, 7),\n" +
                "(1161010104, 11610101, 501, 404, 8),\n" +
                "(1161010105, 11610101, 502, 401, 6),\n" +
                "(1161010106, 11610101, 502, 401, 9),\n" +
                "(1161010107, 11610101, 502, 402, 6),\n" +
                "(1161010108, 11610101, 502, 403, 5),\n" +
                "(1161010109, 11610101, 502, 404, 7),\n" +
                "(1161010110, 11610101, 503, 401, 8),\n" +
                "(1161010111, 11610101, 503, 401, 9),\n" +
                "(1161010112, 11610101, 503, 402, 5),\n" +
                "(1161010113, 11610101, 503, 403, 6),\n" +
                "(1161010114, 11610101, 503, 404, 7),\n" +
                "(1161010115, 11610101, 504, 401, 8),\n" +
                "(1161010116, 11610101, 504, 401, 7),\n" +
                "(1161010117, 11610101, 504, 402, 8),\n" +
                "(1161010118, 11610101, 504, 403, 7),\n" +
                "(1161010119, 11610101, 504, 404, 8),\n" +
                "(1161010120, 11610101, 505, 401, 6),\n" +
                "(1161010121, 11610101, 505, 401, 9),\n" +
                "(1161010122, 11610101, 505, 402, 6),\n" +
                "(1161010123, 11610101, 505, 403, 5),\n" +
                "(1161010124, 11610101, 505, 404, 7),\n" +
                "(1161010201, 11610102, 501, 401, 7),\n" +
                "(1161010202, 11610102, 501, 402, 8),\n" +
                "(1161010203, 11610102, 501, 403, 7),\n" +
                "(1161010204, 11610102, 501, 404, 8),\n" +
                "(1161010205, 11610102, 502, 401, 7),\n" +
                "(1161010206, 11610102, 502, 401, 8),\n" +
                "(1161010207, 11610102, 502, 402, 6),\n" +
                "(1161010208, 11610102, 502, 403, 9),\n" +
                "(1161010209, 11610102, 502, 404, 6),\n" +
                "(1161010210, 11610102, 503, 401, 5),\n" +
                "(1161010211, 11610102, 503, 401, 7),\n" +
                "(1161010212, 11610102, 503, 402, 8),\n" +
                "(1161010213, 11610102, 503, 403, 9),\n" +
                "(1161010214, 11610102, 503, 404, 5),\n" +
                "(1161010215, 11610102, 504, 401, 6),\n" +
                "(1161010216, 11610102, 504, 401, 7),\n" +
                "(1161010217, 11610102, 504, 402, 8),\n" +
                "(1161010218, 11610102, 504, 403, 7),\n" +
                "(1161010219, 11610102, 504, 404, 8),\n" +
                "(1161010220, 11610102, 505, 401, 7),\n" +
                "(1161010221, 11610102, 505, 401, 8),\n" +
                "(1161010222, 11610102, 505, 402, 6),\n" +
                "(1161010223, 11610102, 505, 403, 9),\n" +
                "(1161010224, 11610102, 505, 404, 6),\n" +
                "(1161010225, 11610103, 501, 401, 8),\n" +
                "(1161010226, 11610103, 501, 402, 9),\n" +
                "(1161010227, 11610103, 501, 403, 5),\n" +
                "(1161010228, 11610103, 501, 404, 6),\n" +
                "(1161010229, 11610103, 502, 401, 7),\n" +
                "(1161010230, 11610103, 502, 401, 8),\n" +
                "(1161010231, 11610103, 502, 402, 7),\n" +
                "(1161010232, 11610103, 502, 403, 8),\n" +
                "(1161010233, 11610103, 502, 404, 7),\n" +
                "(1161010234, 11610103, 503, 401, 8),\n" +
                "(1161010235, 11610103, 503, 401, 6),\n" +
                "(1161010236, 11610103, 503, 402, 9),\n" +
                "(1161010237, 11610103, 503, 403, 6),\n" +
                "(1161010238, 11610103, 503, 404, 5),\n" +
                "(1161010239, 11610103, 504, 401, 7),\n" +
                "(1161010240, 11610103, 504, 401, 8),\n" +
                "(1161010241, 11610103, 504, 402, 9),\n" +
                "(1161010242, 11610103, 504, 403, 5),\n" +
                "(1161010243, 11610103, 504, 404, 6),\n" +
                "(1161010244, 11610103, 505, 401, 7),\n" +
                "(1161010245, 11610103, 505, 401, 8),\n" +
                "(1161010246, 11610103, 505, 402, 7),\n" +
                "(1161010247, 11610103, 505, 403, 8),\n" +
                "(1161010248, 11610103, 505, 404, 7),\n" +
                "(1161010249, 21610101, 501, 401, 7),\n" +
                "(1161010250, 21610101, 501, 402, 8),\n" +
                "(1161010251, 21610101, 501, 403, 7),\n" +
                "(1161010252, 21610101, 501, 404, 8),\n" +
                "(1161010253, 21610101, 502, 401, 7),\n" +
                "(1161010254, 21610101, 502, 401, 8),\n" +
                "(1161010255, 21610101, 502, 402, 6),\n" +
                "(1161010256, 21610101, 502, 403, 9),\n" +
                "(1161010257, 21610101, 502, 404, 6),\n" +
                "(1161010258, 21610101, 503, 401, 5),\n" +
                "(1161010259, 21610101, 503, 401, 7),\n" +
                "(1161010260, 21610101, 503, 402, 8),\n" +
                "(1161010261, 21610101, 503, 403, 9),\n" +
                "(1161010262, 21610101, 503, 404, 5),\n" +
                "(1161010263, 21610101, 504, 401, 6),\n" +
                "(1161010264, 21610101, 504, 401, 7),\n" +
                "(1161010265, 21610101, 504, 402, 8),\n" +
                "(1161010266, 21610101, 504, 403, 7),\n" +
                "(1161010267, 21610101, 504, 404, 8),\n" +
                "(1161010268, 21610101, 505, 401, 7),\n" +
                "(1161010269, 21610101, 505, 401, 8),\n" +
                "(1161010270, 21610101, 505, 402, 6),\n" +
                "(1161010271, 21610101, 505, 403, 9),\n" +
                "(1161010272, 21610101, 505, 404, 6),\n" +
                "(1161020101, 11610201, 501, 401, 7),\n" +
                "(1161020102, 11610201, 501, 402, 8),\n" +
                "(1161020103, 11610201, 501, 403, 7),\n" +
                "(1161020104, 11610201, 501, 404, 8),\n" +
                "(1161020105, 11610201, 502, 401, 7),\n" +
                "(1161020106, 11610201, 502, 401, 8),\n" +
                "(1161020107, 11610201, 502, 402, 6),\n" +
                "(1161020108, 11610201, 502, 403, 9),\n" +
                "(1161020109, 11610201, 502, 404, 6),\n" +
                "(1161020110, 11610201, 503, 401, 5),\n" +
                "(1161020111, 11610201, 503, 401, 7),\n" +
                "(1161020112, 11610201, 503, 402, 8),\n" +
                "(1161020113, 11610201, 503, 403, 9),\n" +
                "(1161020114, 11610201, 503, 404, 5),\n" +
                "(1161020115, 11610201, 504, 401, 6),\n" +
                "(1161020116, 11610201, 504, 401, 7),\n" +
                "(1161020117, 11610201, 504, 402, 8),\n" +
                "(1161020118, 11610201, 504, 403, 7),\n" +
                "(1161020119, 11610201, 504, 404, 8),\n" +
                "(1161020120, 11610201, 505, 401, 7),\n" +
                "(1161020121, 11610201, 505, 401, 8),\n" +
                "(1161020122, 11610201, 505, 402, 6),\n" +
                "(1161020123, 11610201, 505, 403, 9),\n" +
                "(1161020124, 11610201, 505, 404, 6),\n" +
                "(1161020201, 11610202, 501, 401, 7),\n" +
                "(1161020202, 11610202, 501, 402, 8),\n" +
                "(1161020203, 11610202, 501, 403, 7),\n" +
                "(1161020204, 11610202, 501, 404, 8),\n" +
                "(1161020205, 11610202, 502, 401, 7),\n" +
                "(1161020206, 11610202, 502, 401, 8),\n" +
                "(1161020207, 11610202, 502, 402, 6),\n" +
                "(1161020208, 11610202, 502, 403, 9),\n" +
                "(1161020209, 11610202, 502, 404, 6),\n" +
                "(1161020210, 11610202, 503, 401, 5),\n" +
                "(1161020211, 11610202, 503, 401, 7),\n" +
                "(1161020212, 11610202, 503, 402, 8),\n" +
                "(1161020213, 11610202, 503, 403, 9),\n" +
                "(1161020214, 11610202, 503, 404, 5),\n" +
                "(1161020215, 11610202, 504, 401, 6),\n" +
                "(1161020216, 11610202, 504, 401, 7),\n" +
                "(1161020217, 11610202, 504, 402, 8),\n" +
                "(1161020218, 11610202, 504, 403, 7),\n" +
                "(1161020219, 11610202, 504, 404, 8),\n" +
                "(1161020220, 11610202, 505, 401, 7),\n" +
                "(1161020221, 11610202, 505, 401, 8),\n" +
                "(1161020222, 11610202, 505, 402, 6),\n" +
                "(1161020223, 11610202, 505, 403, 9),\n" +
                "(1161020224, 11610202, 505, 404, 6),\n" +
                "(1161020301, 11610203, 501, 401, 7),\n" +
                "(1161020302, 11610203, 501, 402, 8),\n" +
                "(1161020303, 11610203, 501, 403, 7),\n" +
                "(1161020304, 11610203, 501, 404, 8),\n" +
                "(1161020305, 11610203, 502, 401, 7),\n" +
                "(1161020306, 11610203, 502, 401, 8),\n" +
                "(1161020307, 11610203, 502, 402, 6),\n" +
                "(1161020308, 11610203, 502, 403, 9),\n" +
                "(1161020309, 11610203, 502, 404, 6),\n" +
                "(1161020310, 11610203, 503, 401, 5),\n" +
                "(1161020311, 11610203, 503, 401, 7),\n" +
                "(1161020312, 11610203, 503, 402, 8),\n" +
                "(1161020313, 11610203, 503, 403, 9),\n" +
                "(1161020314, 11610203, 503, 404, 5),\n" +
                "(1161020315, 11610203, 504, 401, 6),\n" +
                "(1161020316, 11610203, 504, 401, 7),\n" +
                "(1161020317, 11610203, 504, 402, 8),\n" +
                "(1161020318, 11610203, 504, 403, 7),\n" +
                "(1161020319, 11610203, 504, 404, 8),\n" +
                "(1161020320, 11610203, 505, 401, 7),\n" +
                "(1161020321, 11610203, 505, 401, 8),\n" +
                "(1161020322, 11610203, 505, 402, 6),\n" +
                "(1161020323, 11610203, 505, 403, 9),\n" +
                "(1161020324, 11610203, 505, 404, 6),\n" +
                "(1161110101, 11611101, 501, 401, 8),\n" +
                "(1161110102, 11611101, 501, 401, 7),\n" +
                "(1161110103, 11611101, 501, 402, 8),\n" +
                "(1161110104, 11611101, 501, 403, 6),\n" +
                "(1161110105, 11611101, 501, 404, 9),\n" +
                "(1161110106, 11611101, 502, 401, 6),\n" +
                "(1161110107, 11611101, 502, 401, 5),\n" +
                "(1161110108, 11611101, 502, 402, 7),\n" +
                "(1161110109, 11611101, 502, 403, 8),\n" +
                "(1161110110, 11611101, 502, 404, 9),\n" +
                "(1161110111, 11611101, 503, 401, 5),\n" +
                "(1161110112, 11611101, 503, 401, 6),\n" +
                "(1161110113, 11611101, 503, 402, 7),\n" +
                "(1161110114, 11611101, 503, 403, 8),\n" +
                "(1161110115, 11611101, 503, 404, 7),\n" +
                "(1161110116, 11611101, 504, 401, 8),\n" +
                "(1161110117, 11611101, 504, 401, 7),\n" +
                "(1161110118, 11611101, 504, 402, 8),\n" +
                "(1161110119, 11611101, 504, 403, 6),\n" +
                "(1161110120, 11611101, 504, 404, 9),\n" +
                "(1161110121, 11611101, 505, 401, 6),\n" +
                "(1161110122, 11611101, 505, 401, 5),\n" +
                "(1161110123, 11611101, 505, 402, 7),\n" +
                "(1161110124, 11611101, 505, 403, 8),\n" +
                "(1161110125, 11611101, 505, 404, 9),\n" +
                "(1161110201, 11611102, 501, 401, 5),\n" +
                "(1161110202, 11611102, 501, 401, 6),\n" +
                "(1161110203, 11611102, 501, 402, 7),\n" +
                "(1161110204, 11611102, 501, 403, 8),\n" +
                "(1161110205, 11611102, 501, 404, 7),\n" +
                "(1161110206, 11611102, 502, 401, 8),\n" +
                "(1161110207, 11611102, 502, 401, 6),\n" +
                "(1161110208, 11611102, 502, 402, 9),\n" +
                "(1161110209, 11611102, 502, 403, 6),\n" +
                "(1161110210, 11611102, 502, 404, 5),\n" +
                "(1161110211, 11611102, 503, 401, 7),\n" +
                "(1161110212, 11611102, 503, 401, 8),\n" +
                "(1161110213, 11611102, 503, 402, 9),\n" +
                "(1161110214, 11611102, 503, 403, 5),\n" +
                "(1161110215, 11611102, 503, 404, 6),\n" +
                "(1161110216, 11611102, 504, 401, 7),\n" +
                "(1161110217, 11611102, 504, 401, 8),\n" +
                "(1161110218, 11611102, 504, 402, 7),\n" +
                "(1161110219, 11611102, 504, 403, 8),\n" +
                "(1161110220, 11611102, 504, 404, 7),\n" +
                "(1161110301, 11611103, 501, 401, 7),\n" +
                "(1161110302, 11611103, 501, 401, 8),\n" +
                "(1161110303, 11611103, 501, 402, 9),\n" +
                "(1161110304, 11611103, 501, 403, 5),\n" +
                "(1161110305, 11611103, 501, 404, 6),\n" +
                "(1161110306, 11611103, 502, 401, 7),\n" +
                "(1161110307, 11611103, 502, 401, 8),\n" +
                "(1161110308, 11611103, 502, 402, 7),\n" +
                "(1161110309, 11611103, 502, 403, 8),\n" +
                "(1161110310, 11611103, 502, 404, 6),\n" +
                "(1161110311, 11611103, 503, 401, 9),\n" +
                "(1161110312, 11611103, 503, 401, 6),\n" +
                "(1161110313, 11611103, 503, 402, 5),\n" +
                "(1161110314, 11611103, 503, 403, 7),\n" +
                "(1161110315, 11611103, 503, 404, 8),\n" +
                "(1161110316, 11611103, 504, 401, 9),\n" +
                "(1161110317, 11611103, 504, 401, 5),\n" +
                "(1161110318, 11611103, 504, 402, 6),\n" +
                "(1161110319, 11611103, 504, 403, 7),\n" +
                "(1161110320, 11611103, 504, 404, 8),\n" +
                "(1161110321, 11611103, 505, 401, 7),\n" +
                "(1161110322, 11611103, 505, 401, 8),\n" +
                "(1161110323, 11611103, 505, 402, 7),\n" +
                "(1161110324, 11611103, 505, 403, 8),\n" +
                "(1161110325, 11611103, 505, 404, 6),\n" +
                "(1161120101, 11611201, 501, 401, 7),\n" +
                "(1161120102, 11611201, 501, 402, 8),\n" +
                "(1161120103, 11611201, 501, 403, 7),\n" +
                "(1161120104, 11611201, 501, 404, 8),\n" +
                "(1161120105, 11611201, 502, 401, 7),\n" +
                "(1161120106, 11611201, 502, 401, 8),\n" +
                "(1161120107, 11611201, 502, 402, 6),\n" +
                "(1161120108, 11611201, 502, 403, 9),\n" +
                "(1161120109, 11611201, 502, 404, 6),\n" +
                "(1161120110, 11611201, 503, 401, 5),\n" +
                "(1161120111, 11611201, 503, 401, 7),\n" +
                "(1161120112, 11611201, 503, 402, 8),\n" +
                "(1161120113, 11611201, 503, 403, 9),\n" +
                "(1161120114, 11611201, 503, 404, 5),\n" +
                "(1161120115, 11611201, 504, 401, 6),\n" +
                "(1161120116, 11611201, 504, 401, 7),\n" +
                "(1161120117, 11611201, 504, 402, 8),\n" +
                "(1161120118, 11611201, 504, 403, 7),\n" +
                "(1161120119, 11611201, 504, 404, 8),\n" +
                "(1161120120, 11611201, 505, 401, 7),\n" +
                "(1161120121, 11611201, 505, 401, 8),\n" +
                "(1161120122, 11611201, 505, 402, 6),\n" +
                "(1161120123, 11611201, 505, 403, 9),\n" +
                "(1161120124, 11611201, 505, 404, 6),\n" +
                "(1161120201, 11611202, 501, 401, 7),\n" +
                "(1161120202, 11611202, 501, 402, 8),\n" +
                "(1161120203, 11611202, 501, 403, 7),\n" +
                "(1161120204, 11611202, 501, 404, 8),\n" +
                "(1161120205, 11611202, 502, 401, 7),\n" +
                "(1161120206, 11611202, 502, 401, 8),\n" +
                "(1161120207, 11611202, 502, 402, 6),\n" +
                "(1161120208, 11611202, 502, 403, 9),\n" +
                "(1161120209, 11611202, 502, 404, 6),\n" +
                "(1161120210, 11611202, 503, 401, 5),\n" +
                "(1161120211, 11611202, 503, 401, 7),\n" +
                "(1161120212, 11611202, 503, 402, 8),\n" +
                "(1161120213, 11611202, 503, 403, 9),\n" +
                "(1161120214, 11611202, 503, 404, 5),\n" +
                "(1161120215, 11611202, 504, 401, 6),\n" +
                "(1161120216, 11611202, 504, 401, 7),\n" +
                "(1161120217, 11611202, 504, 402, 8),\n" +
                "(1161120218, 11611202, 504, 403, 7),\n" +
                "(1161120219, 11611202, 504, 404, 8),\n" +
                "(1161120220, 11611202, 505, 401, 7),\n" +
                "(1161120221, 11611202, 505, 401, 8),\n" +
                "(1161120222, 11611202, 505, 402, 6),\n" +
                "(1161120223, 11611202, 505, 403, 9),\n" +
                "(1161120224, 11611202, 505, 404, 6),\n" +
                "(1161120301, 11611203, 501, 401, 7),\n" +
                "(1161120302, 11611203, 501, 402, 8),\n" +
                "(1161120303, 11611203, 501, 403, 7),\n" +
                "(1161120304, 11611203, 501, 404, 8),\n" +
                "(1161120305, 11611203, 502, 401, 7),\n" +
                "(1161120306, 11611203, 502, 401, 8),\n" +
                "(1161120307, 11611203, 502, 402, 6),\n" +
                "(1161120308, 11611203, 502, 403, 9),\n" +
                "(1161120309, 11611203, 502, 404, 6),\n" +
                "(1161120310, 11611203, 503, 401, 5),\n" +
                "(1161120311, 11611203, 503, 401, 7),\n" +
                "(1161120312, 11611203, 503, 402, 8),\n" +
                "(1161120313, 11611203, 503, 403, 9),\n" +
                "(1161120314, 11611203, 503, 404, 5),\n" +
                "(1161120315, 11611203, 504, 401, 6),\n" +
                "(1161120316, 11611203, 504, 401, 7),\n" +
                "(1161120317, 11611203, 504, 402, 8),\n" +
                "(1161120318, 11611203, 504, 403, 7),\n" +
                "(1161120319, 11611203, 504, 404, 8),\n" +
                "(1161120320, 11611203, 505, 401, 7),\n" +
                "(1161120321, 11611203, 505, 401, 8),\n" +
                "(1161120322, 11611203, 505, 402, 6),\n" +
                "(1161120323, 11611203, 505, 403, 9),\n" +
                "(1161120324, 11611203, 505, 404, 6),\n" +
                "(1161210101, 11612101, 501, 401, 7),\n" +
                "(1161210102, 11612101, 501, 402, 8),\n" +
                "(1161210103, 11612101, 501, 403, 7),\n" +
                "(1161210104, 11612101, 501, 404, 8),\n" +
                "(1161210105, 11612101, 502, 401, 6),\n" +
                "(1161210106, 11612101, 502, 401, 9),\n" +
                "(1161210107, 11612101, 502, 402, 6),\n" +
                "(1161210108, 11612101, 502, 403, 5),\n" +
                "(1161210109, 11612101, 502, 404, 7),\n" +
                "(1161210110, 11612101, 503, 401, 8),\n" +
                "(1161210111, 11612101, 503, 401, 9),\n" +
                "(1161210112, 11612101, 503, 402, 5),\n" +
                "(1161210113, 11612101, 503, 403, 6),\n" +
                "(1161210114, 11612101, 503, 404, 7),\n" +
                "(1161210115, 11612101, 504, 401, 8),\n" +
                "(1161210116, 11612101, 504, 401, 7),\n" +
                "(1161210117, 11612101, 504, 402, 8),\n" +
                "(1161210118, 11612101, 504, 403, 7),\n" +
                "(1161210119, 11612101, 504, 404, 8),\n" +
                "(1161210120, 11612101, 505, 401, 6),\n" +
                "(1161210121, 11612101, 505, 401, 9),\n" +
                "(1161210122, 11612101, 505, 402, 6),\n" +
                "(1161210123, 11612101, 505, 403, 5),\n" +
                "(1161210124, 11612101, 505, 404, 7),\n" +
                "(1161210201, 11612102, 501, 401, 7),\n" +
                "(1161210202, 11612102, 501, 402, 8),\n" +
                "(1161210203, 11612102, 501, 403, 7),\n" +
                "(1161210204, 11612102, 501, 404, 8),\n" +
                "(1161210205, 11612102, 502, 401, 7),\n" +
                "(1161210206, 11612102, 502, 401, 8),\n" +
                "(1161210207, 11612102, 502, 402, 6),\n" +
                "(1161210208, 11612102, 502, 403, 9),\n" +
                "(1161210209, 11612102, 502, 404, 6),\n" +
                "(1161210210, 11612102, 503, 401, 5),\n" +
                "(1161210211, 11612102, 503, 401, 7),\n" +
                "(1161210212, 11612102, 503, 402, 8),\n" +
                "(1161210213, 11612102, 503, 403, 9),\n" +
                "(1161210214, 11612102, 503, 404, 5),\n" +
                "(1161210215, 11612102, 504, 401, 6),\n" +
                "(1161210216, 11612102, 504, 401, 7),\n" +
                "(1161210217, 11612102, 504, 402, 8),\n" +
                "(1161210218, 11612102, 504, 403, 7),\n" +
                "(1161210219, 11612102, 504, 404, 8),\n" +
                "(1161210220, 11612102, 505, 401, 7),\n" +
                "(1161210221, 11612102, 505, 401, 8),\n" +
                "(1161210222, 11612102, 505, 402, 6),\n" +
                "(1161210223, 11612102, 505, 403, 9),\n" +
                "(1161210224, 11612102, 505, 404, 6),\n" +
                "(1161210301, 11612103, 501, 401, 8),\n" +
                "(1161210302, 11612103, 501, 402, 9),\n" +
                "(1161210303, 11612103, 501, 403, 5),\n" +
                "(1161210304, 11612103, 501, 404, 6),\n" +
                "(1161210305, 11612103, 502, 401, 7),\n" +
                "(1161210306, 11612103, 502, 401, 8),\n" +
                "(1161210307, 11612103, 502, 402, 7),\n" +
                "(1161210308, 11612103, 502, 403, 8),\n" +
                "(1161210309, 11612103, 502, 404, 7),\n" +
                "(1161210310, 11612103, 503, 401, 8),\n" +
                "(1161210311, 11612103, 503, 401, 6),\n" +
                "(1161210312, 11612103, 503, 402, 9),\n" +
                "(1161210313, 11612103, 503, 403, 6),\n" +
                "(1161210314, 11612103, 503, 404, 5),\n" +
                "(1161210315, 11612103, 504, 401, 7),\n" +
                "(1161210316, 11612103, 504, 401, 8),\n" +
                "(1161210317, 11612103, 504, 402, 9),\n" +
                "(1161210318, 11612103, 504, 403, 5),\n" +
                "(1161210319, 11612103, 504, 404, 6),\n" +
                "(1161210320, 11612103, 505, 401, 7),\n" +
                "(1161210321, 11612103, 505, 401, 8),\n" +
                "(1161210322, 11612103, 505, 402, 7),\n" +
                "(1161210323, 11612103, 505, 403, 8),\n" +
                "(1161210324, 11612103, 505, 404, 7),\n" +
                "(1161220101, 11612201, 501, 401, 6),\n" +
                "(1161220102, 11612201, 501, 402, 7),\n" +
                "(1161220103, 11612201, 501, 403, 8),\n" +
                "(1161220104, 11612201, 501, 404, 7),\n" +
                "(1161220105, 11612201, 502, 401, 8),\n" +
                "(1161220106, 11612201, 502, 401, 6),\n" +
                "(1161220107, 11612201, 502, 402, 9),\n" +
                "(1161220108, 11612201, 502, 403, 6),\n" +
                "(1161220109, 11612201, 502, 404, 5),\n" +
                "(1161220110, 11612201, 503, 401, 7),\n" +
                "(1161220111, 11612201, 503, 401, 7),\n" +
                "(1161220112, 11612201, 503, 402, 8),\n" +
                "(1161220113, 11612201, 503, 403, 7),\n" +
                "(1161220114, 11612201, 503, 404, 8),\n" +
                "(1161220115, 11612201, 504, 401, 7),\n" +
                "(1161220116, 11612201, 504, 401, 8),\n" +
                "(1161220117, 11612201, 504, 402, 6),\n" +
                "(1161220118, 11612201, 504, 403, 9),\n" +
                "(1161220119, 11612201, 504, 404, 6),\n" +
                "(1161220120, 11612201, 505, 401, 5),\n" +
                "(1161220121, 11612201, 505, 401, 7),\n" +
                "(1161220122, 11612201, 505, 402, 8),\n" +
                "(1161220123, 11612201, 505, 403, 9),\n" +
                "(1161220124, 11612201, 505, 404, 5),\n" +
                "(1161220201, 11612202, 501, 401, 6),\n" +
                "(1161220202, 11612202, 501, 402, 7),\n" +
                "(1161220203, 11612202, 501, 403, 8),\n" +
                "(1161220204, 11612202, 501, 404, 7),\n" +
                "(1161220205, 11612202, 502, 401, 8),\n" +
                "(1161220206, 11612202, 502, 401, 6),\n" +
                "(1161220207, 11612202, 502, 402, 9),\n" +
                "(1161220208, 11612202, 502, 403, 6),\n" +
                "(1161220209, 11612202, 502, 404, 5),\n" +
                "(1161220210, 11612202, 503, 401, 7),\n" +
                "(1161220211, 11612202, 503, 401, 7),\n" +
                "(1161220212, 11612202, 503, 402, 8),\n" +
                "(1161220213, 11612202, 503, 403, 7),\n" +
                "(1161220214, 11612202, 503, 404, 8),\n" +
                "(1161220215, 11612202, 504, 401, 7),\n" +
                "(1161220216, 11612202, 504, 401, 8),\n" +
                "(1161220217, 11612202, 504, 402, 6),\n" +
                "(1161220218, 11612202, 504, 403, 9),\n" +
                "(1161220219, 11612202, 504, 404, 6),\n" +
                "(1161220220, 11612202, 505, 401, 5),\n" +
                "(1161220221, 11612202, 505, 401, 7),\n" +
                "(1161220222, 11612202, 505, 402, 8),\n" +
                "(1161220223, 11612202, 505, 403, 9),\n" +
                "(1161220224, 11612202, 505, 404, 5),\n" +
                "(1161220301, 11612203, 501, 401, 6),\n" +
                "(1161220302, 11612203, 501, 402, 7),\n" +
                "(1161220303, 11612203, 501, 403, 8),\n" +
                "(1161220304, 11612203, 501, 404, 7),\n" +
                "(1161220305, 11612203, 502, 401, 8),\n" +
                "(1161220306, 11612203, 502, 401, 6),\n" +
                "(1161220307, 11612203, 502, 402, 9),\n" +
                "(1161220308, 11612203, 502, 403, 6),\n" +
                "(1161220309, 11612203, 502, 404, 5),\n" +
                "(1161220310, 11612203, 503, 401, 7),\n" +
                "(1161220311, 11612203, 503, 401, 10),\n" +
                "(1161220312, 11612203, 503, 402, 8),\n" +
                "(1161220313, 11612203, 503, 403, 8),\n" +
                "(1161220314, 11612203, 503, 404, 7),\n" +
                "(1161220315, 11612203, 504, 401, 8),\n" +
                "(1161220316, 11612203, 504, 401, 7),\n" +
                "(1161220317, 11612203, 504, 402, 8),\n" +
                "(1161220318, 11612203, 504, 403, 6),\n" +
                "(1161220319, 11612203, 504, 404, 9),\n" +
                "(1161220320, 11612203, 505, 401, 6),\n" +
                "(1161220321, 11612203, 505, 401, 5),\n" +
                "(1161220322, 11612203, 505, 402, 7),\n" +
                "(1161220323, 11612203, 505, 403, 8),\n" +
                "(1161220324, 11612203, 505, 404, 9),\n" +
                "(2161010201, 21610102, 501, 401, 8),\n" +
                "(2161010202, 21610102, 501, 402, 9),\n" +
                "(2161010203, 21610102, 501, 403, 5),\n" +
                "(2161010204, 21610102, 501, 404, 6),\n" +
                "(2161010205, 21610102, 502, 401, 7),\n" +
                "(2161010206, 21610102, 502, 401, 8),\n" +
                "(2161010207, 21610102, 502, 402, 7),\n" +
                "(2161010208, 21610102, 502, 403, 8),\n" +
                "(2161010209, 21610102, 502, 404, 7),\n" +
                "(2161010210, 21610102, 503, 401, 8),\n" +
                "(2161010211, 21610102, 503, 401, 6),\n" +
                "(2161010212, 21610102, 503, 402, 9),\n" +
                "(2161010213, 21610102, 503, 403, 6),\n" +
                "(2161010214, 21610102, 504, 401, 7),\n" +
                "(2161010215, 21610102, 504, 401, 7),\n" +
                "(2161010216, 21610102, 504, 401, 8),\n" +
                "(2161010217, 21610102, 504, 402, 9),\n" +
                "(2161010218, 21610102, 504, 403, 5),\n" +
                "(2161010219, 21610102, 504, 404, 6),\n" +
                "(2161010220, 21610102, 505, 401, 7),\n" +
                "(2161010221, 21610102, 505, 401, 8),\n" +
                "(2161010222, 21610102, 505, 402, 7),\n" +
                "(2161010223, 21610102, 505, 403, 8),\n" +
                "(2161010224, 21610102, 505, 404, 7),\n" +
                "(2161010301, 21610103, 501, 401, 7),\n" +
                "(2161010302, 21610103, 501, 402, 8),\n" +
                "(2161010303, 21610103, 501, 403, 7),\n" +
                "(2161010304, 21610103, 501, 404, 8),\n" +
                "(2161010305, 21610103, 502, 401, 7),\n" +
                "(2161010306, 21610103, 502, 401, 8),\n" +
                "(2161010307, 21610103, 502, 402, 6),\n" +
                "(2161010308, 21610103, 502, 403, 9),\n" +
                "(2161010309, 21610103, 502, 404, 6),\n" +
                "(2161010310, 21610103, 503, 401, 5),\n" +
                "(2161010311, 21610103, 503, 401, 7),\n" +
                "(2161010312, 21610103, 503, 402, 8),\n" +
                "(2161010313, 21610103, 503, 403, 9),\n" +
                "(2161010314, 21610103, 503, 404, 5),\n" +
                "(2161010315, 21610103, 504, 401, 6),\n" +
                "(2161010316, 21610103, 504, 401, 7),\n" +
                "(2161010317, 21610103, 504, 402, 8),\n" +
                "(2161010318, 21610103, 504, 403, 7),\n" +
                "(2161010319, 21610103, 504, 404, 8),\n" +
                "(2161010320, 21610103, 505, 401, 7),\n" +
                "(2161010321, 21610103, 505, 401, 8),\n" +
                "(2161010322, 21610103, 505, 402, 6),\n" +
                "(2161010323, 21610103, 505, 403, 9),\n" +
                "(2161010324, 21610103, 505, 404, 6),\n" +
                "(2161020101, 21610201, 501, 401, 8),\n" +
                "(2161020102, 21610201, 501, 402, 8),\n" +
                "(2161020103, 21610201, 501, 403, 7),\n" +
                "(2161020104, 21610201, 501, 404, 8),\n" +
                "(2161020105, 21610201, 502, 401, 7),\n" +
                "(2161020106, 21610201, 502, 401, 8),\n" +
                "(2161020107, 21610201, 502, 402, 6),\n" +
                "(2161020108, 21610201, 502, 403, 9),\n" +
                "(2161020109, 21610201, 502, 404, 6),\n" +
                "(2161020110, 21610201, 503, 401, 5),\n" +
                "(2161020111, 21610201, 503, 401, 7),\n" +
                "(2161020112, 21610201, 503, 402, 8),\n" +
                "(2161020113, 21610201, 503, 403, 9),\n" +
                "(2161020114, 21610201, 503, 404, 5),\n" +
                "(2161020115, 21610201, 504, 401, 6),\n" +
                "(2161020116, 21610201, 504, 401, 7),\n" +
                "(2161020117, 21610201, 504, 402, 8),\n" +
                "(2161020118, 21610201, 504, 403, 7),\n" +
                "(2161020119, 21610201, 504, 404, 8),\n" +
                "(2161020120, 21610201, 505, 401, 7),\n" +
                "(2161020121, 21610201, 505, 401, 8),\n" +
                "(2161020122, 21610201, 505, 402, 6),\n" +
                "(2161020123, 21610201, 505, 403, 9),\n" +
                "(2161020124, 21610201, 505, 404, 6),\n" +
                "(2161020201, 21610202, 501, 401, 7),\n" +
                "(2161020202, 21610202, 501, 402, 8),\n" +
                "(2161020203, 21610202, 501, 403, 7),\n" +
                "(2161020204, 21610202, 501, 404, 8),\n" +
                "(2161020205, 21610202, 502, 401, 7),\n" +
                "(2161020206, 21610202, 502, 401, 8),\n" +
                "(2161020207, 21610202, 502, 402, 6),\n" +
                "(2161020208, 21610202, 502, 403, 9),\n" +
                "(2161020209, 21610202, 502, 404, 6),\n" +
                "(2161020210, 21610202, 503, 401, 5),\n" +
                "(2161020211, 21610202, 503, 401, 7),\n" +
                "(2161020212, 21610202, 503, 402, 8),\n" +
                "(2161020213, 21610202, 503, 403, 9),\n" +
                "(2161020214, 21610202, 503, 404, 5),\n" +
                "(2161020215, 21610202, 504, 401, 6),\n" +
                "(2161020216, 21610202, 504, 401, 7),\n" +
                "(2161020217, 21610202, 504, 402, 8),\n" +
                "(2161020218, 21610202, 504, 403, 7),\n" +
                "(2161020219, 21610202, 504, 404, 8),\n" +
                "(2161020220, 21610202, 505, 401, 7),\n" +
                "(2161020221, 21610202, 505, 401, 8),\n" +
                "(2161020222, 21610202, 505, 402, 6),\n" +
                "(2161020223, 21610202, 505, 403, 9),\n" +
                "(2161020224, 21610202, 505, 404, 6),\n" +
                "(2161020301, 21610203, 501, 401, 7),\n" +
                "(2161020302, 21610203, 501, 402, 8),\n" +
                "(2161020303, 21610203, 501, 403, 7),\n" +
                "(2161020304, 21610203, 501, 404, 8),\n" +
                "(2161020305, 21610203, 502, 401, 7),\n" +
                "(2161020306, 21610203, 502, 401, 8),\n" +
                "(2161020307, 21610203, 502, 402, 6),\n" +
                "(2161020308, 21610203, 502, 403, 9),\n" +
                "(2161020309, 21610203, 502, 404, 6),\n" +
                "(2161020310, 21610203, 503, 401, 5),\n" +
                "(2161020311, 21610203, 503, 401, 7),\n" +
                "(2161020312, 21610203, 503, 402, 8),\n" +
                "(2161020313, 21610203, 503, 403, 9),\n" +
                "(2161020314, 21610203, 503, 404, 5),\n" +
                "(2161020315, 21610203, 504, 401, 6),\n" +
                "(2161020316, 21610203, 504, 401, 7),\n" +
                "(2161020317, 21610203, 504, 402, 8),\n" +
                "(2161020318, 21610203, 504, 403, 7),\n" +
                "(2161020319, 21610203, 504, 404, 8),\n" +
                "(2161020320, 21610203, 505, 401, 7),\n" +
                "(2161020321, 21610203, 505, 401, 8),\n" +
                "(2161020322, 21610203, 505, 402, 6),\n" +
                "(2161020323, 21610203, 505, 403, 9),\n" +
                "(2161020324, 21610203, 505, 404, 6),\n" +
                "(2161110101, 21611101, 501, 401, 6),\n" +
                "(2161110102, 21611101, 501, 402, 7),\n" +
                "(2161110103, 21611101, 501, 403, 8),\n" +
                "(2161110104, 21611101, 501, 404, 7),\n" +
                "(2161110105, 21611101, 502, 401, 9),\n" +
                "(2161110106, 21611101, 502, 401, 5),\n" +
                "(2161110107, 21611101, 502, 402, 6),\n" +
                "(2161110108, 21611101, 502, 403, 7),\n" +
                "(2161110109, 21611101, 502, 404, 8),\n" +
                "(2161110110, 21611101, 503, 401, 7),\n" +
                "(2161110111, 21611101, 503, 401, 8),\n" +
                "(2161110112, 21611101, 503, 402, 7),\n" +
                "(2161110113, 21611101, 503, 403, 8),\n" +
                "(2161110114, 21611101, 503, 404, 6),\n" +
                "(2161110115, 21611101, 504, 401, 9),\n" +
                "(2161110116, 21611101, 504, 401, 6),\n" +
                "(2161110117, 21611101, 504, 402, 5),\n" +
                "(2161110118, 21611101, 504, 403, 7),\n" +
                "(2161110119, 21611101, 504, 404, 8),\n" +
                "(2161110120, 21611101, 505, 401, 9),\n" +
                "(2161110121, 21611101, 505, 401, 5),\n" +
                "(2161110122, 21611101, 505, 402, 6),\n" +
                "(2161110123, 21611101, 505, 403, 7),\n" +
                "(2161110124, 21611101, 505, 404, 8),\n" +
                "(2161110201, 21611102, 501, 401, 7),\n" +
                "(2161110202, 21611102, 501, 402, 8),\n" +
                "(2161110203, 21611102, 501, 403, 6),\n" +
                "(2161110204, 21611102, 501, 404, 9),\n" +
                "(2161110205, 21611102, 502, 401, 6),\n" +
                "(2161110206, 21611102, 502, 401, 5),\n" +
                "(2161110207, 21611102, 502, 402, 7),\n" +
                "(2161110208, 21611102, 502, 403, 8),\n" +
                "(2161110209, 21611102, 502, 404, 9),\n" +
                "(2161110210, 21611102, 503, 401, 5),\n" +
                "(2161110211, 21611102, 503, 401, 6),\n" +
                "(2161110212, 21611102, 503, 402, 7),\n" +
                "(2161110213, 21611102, 503, 403, 8),\n" +
                "(2161110214, 21611102, 503, 404, 7),\n" +
                "(2161110215, 21611102, 504, 401, 8),\n" +
                "(2161110216, 21611102, 504, 401, 7),\n" +
                "(2161110217, 21611102, 504, 402, 8),\n" +
                "(2161110218, 21611102, 504, 403, 6),\n" +
                "(2161110219, 21611102, 504, 404, 9),\n" +
                "(2161110220, 21611102, 505, 401, 6),\n" +
                "(2161110221, 21611102, 505, 401, 5),\n" +
                "(2161110222, 21611102, 505, 402, 7),\n" +
                "(2161110223, 21611102, 505, 403, 8),\n" +
                "(2161110224, 21611102, 505, 404, 9),\n" +
                "(2161110301, 21611103, 501, 401, 7),\n" +
                "(2161110302, 21611103, 501, 402, 8),\n" +
                "(2161110303, 21611103, 501, 403, 7),\n" +
                "(2161110304, 21611103, 501, 404, 8),\n" +
                "(2161110305, 21611103, 502, 401, 7),\n" +
                "(2161110306, 21611103, 502, 401, 8),\n" +
                "(2161110307, 21611103, 502, 402, 6),\n" +
                "(2161110308, 21611103, 502, 403, 9),\n" +
                "(2161110309, 21611103, 502, 404, 6),\n" +
                "(2161110310, 21611103, 503, 401, 5),\n" +
                "(2161110311, 21611103, 503, 401, 7),\n" +
                "(2161110312, 21611103, 503, 402, 8),\n" +
                "(2161110313, 21611103, 503, 403, 9),\n" +
                "(2161110314, 21611103, 503, 404, 5),\n" +
                "(2161110315, 21611103, 504, 401, 6),\n" +
                "(2161110316, 21611103, 504, 401, 7),\n" +
                "(2161110317, 21611103, 504, 402, 8),\n" +
                "(2161110318, 21611103, 504, 403, 7),\n" +
                "(2161110319, 21611103, 504, 404, 8),\n" +
                "(2161110320, 21611103, 505, 401, 7),\n" +
                "(2161110321, 21611103, 505, 401, 8),\n" +
                "(2161110322, 21611103, 505, 402, 6),\n" +
                "(2161110323, 21611103, 505, 403, 9),\n" +
                "(2161110324, 21611103, 505, 404, 6),\n" +
                "(2161120101, 21611201, 501, 401, 7),\n" +
                "(2161120102, 21611201, 501, 402, 8),\n" +
                "(2161120103, 21611201, 501, 403, 7),\n" +
                "(2161120104, 21611201, 501, 404, 8),\n" +
                "(2161120105, 21611201, 502, 401, 7),\n" +
                "(2161120106, 21611201, 502, 401, 8),\n" +
                "(2161120107, 21611201, 502, 402, 6),\n" +
                "(2161120108, 21611201, 502, 403, 9),\n" +
                "(2161120109, 21611201, 502, 404, 6),\n" +
                "(2161120110, 21611201, 503, 401, 5),\n" +
                "(2161120111, 21611201, 503, 401, 7),\n" +
                "(2161120112, 21611201, 503, 402, 8),\n" +
                "(2161120113, 21611201, 503, 403, 9),\n" +
                "(2161120114, 21611201, 503, 404, 5),\n" +
                "(2161120115, 21611201, 504, 401, 6),\n" +
                "(2161120116, 21611201, 504, 401, 7),\n" +
                "(2161120117, 21611201, 504, 402, 8),\n" +
                "(2161120118, 21611201, 504, 403, 7),\n" +
                "(2161120119, 21611201, 504, 404, 8),\n" +
                "(2161120120, 21611201, 505, 401, 7),\n" +
                "(2161120121, 21611201, 505, 401, 8),\n" +
                "(2161120122, 21611201, 505, 402, 6),\n" +
                "(2161120123, 21611201, 505, 403, 9),\n" +
                "(2161120124, 21611201, 505, 404, 6),\n" +
                "(2161120201, 21611202, 501, 401, 7),\n" +
                "(2161120202, 21611202, 501, 402, 8),\n" +
                "(2161120203, 21611202, 501, 403, 7),\n" +
                "(2161120204, 21611202, 501, 404, 8),\n" +
                "(2161120205, 21611202, 502, 401, 7),\n" +
                "(2161120206, 21611202, 502, 401, 8),\n" +
                "(2161120207, 21611202, 502, 402, 6),\n" +
                "(2161120208, 21611202, 502, 403, 9),\n" +
                "(2161120209, 21611202, 502, 404, 6),\n" +
                "(2161120210, 21611202, 503, 401, 5),\n" +
                "(2161120211, 21611202, 503, 401, 7),\n" +
                "(2161120212, 21611202, 503, 402, 8),\n" +
                "(2161120213, 21611202, 503, 403, 9),\n" +
                "(2161120214, 21611202, 503, 404, 5),\n" +
                "(2161120215, 21611202, 504, 401, 6),\n" +
                "(2161120216, 21611202, 504, 401, 7),\n" +
                "(2161120217, 21611202, 504, 402, 8),\n" +
                "(2161120218, 21611202, 504, 403, 7),\n" +
                "(2161120219, 21611202, 504, 404, 8),\n" +
                "(2161120220, 21611202, 505, 401, 7),\n" +
                "(2161120221, 21611202, 505, 401, 8),\n" +
                "(2161120222, 21611202, 505, 402, 6),\n" +
                "(2161120223, 21611202, 505, 403, 9),\n" +
                "(2161120224, 21611202, 505, 404, 6),\n" +
                "(2161120301, 21611203, 501, 401, 7),\n" +
                "(2161120302, 21611203, 501, 402, 8),\n" +
                "(2161120303, 21611203, 501, 403, 7),\n" +
                "(2161120304, 21611203, 501, 404, 8),\n" +
                "(2161120305, 21611203, 502, 401, 7),\n" +
                "(2161120306, 21611203, 502, 401, 8),\n" +
                "(2161120307, 21611203, 502, 402, 6),\n" +
                "(2161120308, 21611203, 502, 403, 9),\n" +
                "(2161120309, 21611203, 502, 404, 6),\n" +
                "(2161120310, 21611203, 503, 401, 5),\n" +
                "(2161120311, 21611203, 503, 401, 7),\n" +
                "(2161120312, 21611203, 503, 402, 8),\n" +
                "(2161120313, 21611203, 503, 403, 9),\n" +
                "(2161120314, 21611203, 503, 404, 5),\n" +
                "(2161120315, 21611203, 504, 401, 6),\n" +
                "(2161120316, 21611203, 504, 401, 7),\n" +
                "(2161120317, 21611203, 504, 402, 8),\n" +
                "(2161120318, 21611203, 504, 403, 7),\n" +
                "(2161120319, 21611203, 504, 404, 8),\n" +
                "(2161120320, 21611203, 505, 401, 7),\n" +
                "(2161120321, 21611203, 505, 401, 8),\n" +
                "(2161120322, 21611203, 505, 402, 6),\n" +
                "(2161120323, 21611203, 505, 403, 9),\n" +
                "(2161120324, 21611203, 505, 404, 6),\n" +
                "(2161210101, 21612101, 501, 401, 5),\n" +
                "(2161210102, 21612101, 501, 402, 6),\n" +
                "(2161210103, 21612101, 501, 403, 7),\n" +
                "(2161210104, 21612101, 501, 404, 8),\n" +
                "(2161210105, 21612101, 502, 401, 7),\n" +
                "(2161210106, 21612101, 502, 401, 8),\n" +
                "(2161210107, 21612101, 502, 402, 6),\n" +
                "(2161210108, 21612101, 502, 403, 9),\n" +
                "(2161210109, 21612101, 502, 404, 6),\n" +
                "(2161210110, 21612101, 503, 401, 5),\n" +
                "(2161210111, 21612101, 503, 401, 7),\n" +
                "(2161210112, 21612101, 503, 402, 8),\n" +
                "(2161210113, 21612101, 503, 403, 9),\n" +
                "(2161210114, 21612101, 503, 404, 5),\n" +
                "(2161210115, 21612101, 504, 401, 6),\n" +
                "(2161210116, 21612101, 504, 401, 7),\n" +
                "(2161210117, 21612101, 504, 402, 8),\n" +
                "(2161210118, 21612101, 504, 403, 7),\n" +
                "(2161210119, 21612101, 504, 404, 8),\n" +
                "(2161210120, 21612101, 505, 401, 7),\n" +
                "(2161210121, 21612101, 505, 401, 8),\n" +
                "(2161210122, 21612101, 505, 402, 6),\n" +
                "(2161210123, 21612101, 505, 403, 9),\n" +
                "(2161210124, 21612101, 505, 404, 6),\n" +
                "(2161210201, 21612102, 501, 401, 5),\n" +
                "(2161210202, 21612102, 501, 402, 7),\n" +
                "(2161210203, 21612102, 501, 403, 8),\n" +
                "(2161210204, 21612102, 501, 404, 9),\n" +
                "(2161210205, 21612102, 502, 401, 5),\n" +
                "(2161210206, 21612102, 502, 401, 6),\n" +
                "(2161210207, 21612102, 502, 402, 7),\n" +
                "(2161210208, 21612102, 502, 403, 8),\n" +
                "(2161210209, 21612102, 502, 404, 7),\n" +
                "(2161210210, 21612102, 503, 401, 8),\n" +
                "(2161210211, 21612102, 503, 401, 6),\n" +
                "(2161210212, 21612102, 503, 402, 9),\n" +
                "(2161210213, 21612102, 503, 403, 6),\n" +
                "(2161210214, 21612102, 503, 404, 5),\n" +
                "(2161210215, 21612102, 504, 401, 7),\n" +
                "(2161210216, 21612102, 504, 401, 8),\n" +
                "(2161210217, 21612102, 504, 402, 9),\n" +
                "(2161210218, 21612102, 504, 403, 5),\n" +
                "(2161210219, 21612102, 504, 404, 6),\n" +
                "(2161210220, 21612102, 505, 401, 7),\n" +
                "(2161210221, 21612102, 505, 401, 8),\n" +
                "(2161210222, 21612102, 505, 402, 7),\n" +
                "(2161210223, 21612102, 505, 403, 8),\n" +
                "(2161210224, 21612102, 505, 404, 7),\n" +
                "(2161210301, 21612103, 501, 401, 8),\n" +
                "(2161210302, 21612103, 501, 402, 6),\n" +
                "(2161210303, 21612103, 501, 403, 9),\n" +
                "(2161210304, 21612103, 501, 404, 6),\n" +
                "(2161210305, 21612103, 502, 401, 5),\n" +
                "(2161210306, 21612103, 502, 401, 7),\n" +
                "(2161210307, 21612103, 502, 402, 8),\n" +
                "(2161210308, 21612103, 502, 403, 9),\n" +
                "(2161210309, 21612103, 502, 404, 5),\n" +
                "(2161210310, 21612103, 503, 401, 6),\n" +
                "(2161210311, 21612103, 503, 401, 7),\n" +
                "(2161210312, 21612103, 503, 402, 8),\n" +
                "(2161210313, 21612103, 503, 403, 7),\n" +
                "(2161210314, 21612103, 503, 404, 6),\n" +
                "(2161210315, 21612103, 504, 401, 7),\n" +
                "(2161210316, 21612103, 504, 401, 7),\n" +
                "(2161210317, 21612103, 504, 402, 8),\n" +
                "(2161210318, 21612103, 504, 403, 8),\n" +
                "(2161210319, 21612103, 504, 404, 6),\n" +
                "(2161210320, 21612103, 505, 401, 9),\n" +
                "(2161210321, 21612103, 505, 401, 6),\n" +
                "(2161210322, 21612103, 505, 402, 5),\n" +
                "(2161210323, 21612103, 505, 403, 7),\n" +
                "(2161210324, 21612103, 505, 404, 8),\n" +
                "(2161220101, 21612201, 501, 401, 5),\n" +
                "(2161220102, 21612201, 501, 402, 6),\n" +
                "(2161220103, 21612201, 501, 403, 7),\n" +
                "(2161220104, 21612201, 501, 404, 8),\n" +
                "(2161220105, 21612201, 502, 401, 7),\n" +
                "(2161220106, 21612201, 502, 401, 8),\n" +
                "(2161220107, 21612201, 502, 402, 6),\n" +
                "(2161220108, 21612201, 502, 403, 9),\n" +
                "(2161220109, 21612201, 502, 404, 6),\n" +
                "(2161220110, 21612201, 503, 401, 5),\n" +
                "(2161220111, 21612201, 503, 401, 7),\n" +
                "(2161220112, 21612201, 503, 402, 7),\n" +
                "(2161220113, 21612201, 503, 403, 8),\n" +
                "(2161220114, 21612201, 503, 404, 7),\n" +
                "(2161220115, 21612201, 504, 401, 8),\n" +
                "(2161220116, 21612201, 504, 401, 7),\n" +
                "(2161220117, 21612201, 504, 402, 8),\n" +
                "(2161220118, 21612201, 504, 403, 6),\n" +
                "(2161220119, 21612201, 504, 404, 9),\n" +
                "(2161220120, 21612201, 505, 401, 6),\n" +
                "(2161220121, 21612201, 505, 401, 5),\n" +
                "(2161220122, 21612201, 505, 402, 7),\n" +
                "(2161220123, 21612201, 505, 403, 8),\n" +
                "(2161220124, 21612201, 505, 404, 9),\n" +
                "(2161220201, 21612202, 501, 401, 5),\n" +
                "(2161220202, 21612202, 501, 402, 6),\n" +
                "(2161220203, 21612202, 501, 403, 7),\n" +
                "(2161220204, 21612202, 501, 404, 8),\n" +
                "(2161220205, 21612202, 502, 401, 7),\n" +
                "(2161220206, 21612202, 502, 401, 8),\n" +
                "(2161220207, 21612202, 502, 402, 6),\n" +
                "(2161220208, 21612202, 502, 403, 9),\n" +
                "(2161220209, 21612202, 502, 404, 6),\n" +
                "(2161220210, 21612202, 503, 401, 5),\n" +
                "(2161220211, 21612202, 503, 401, 7),\n" +
                "(2161220212, 21612202, 503, 402, 7),\n" +
                "(2161220213, 21612202, 503, 403, 8),\n" +
                "(2161220214, 21612202, 503, 404, 7),\n" +
                "(2161220215, 21612202, 504, 401, 8),\n" +
                "(2161220216, 21612202, 504, 401, 7),\n" +
                "(2161220217, 21612202, 504, 402, 8),\n" +
                "(2161220218, 21612202, 504, 403, 6),\n" +
                "(2161220219, 21612202, 504, 404, 9),\n" +
                "(2161220220, 21612202, 505, 401, 6),\n" +
                "(2161220221, 21612202, 505, 401, 5),\n" +
                "(2161220222, 21612202, 505, 402, 7),\n" +
                "(2161220223, 21612202, 505, 403, 8),\n" +
                "(2161220224, 21612202, 505, 404, 9),\n" +
                "(2161220301, 21612203, 501, 401, 5),\n" +
                "(2161220302, 21612203, 501, 402, 6),\n" +
                "(2161220303, 21612203, 501, 403, 7),\n" +
                "(2161220304, 21612203, 501, 404, 8),\n" +
                "(2161220305, 21612203, 502, 401, 7),\n" +
                "(2161220306, 21612203, 502, 401, 8),\n" +
                "(2161220307, 21612203, 502, 402, 6),\n" +
                "(2161220308, 21612203, 502, 403, 9),\n" +
                "(2161220309, 21612203, 502, 404, 6),\n" +
                "(2161220310, 21612203, 503, 401, 5),\n" +
                "(2161220311, 21612203, 503, 401, 7),\n" +
                "(2161220312, 21612203, 503, 402, 7),\n" +
                "(2161220313, 21612203, 503, 403, 8),\n" +
                "(2161220314, 21612203, 503, 404, 7),\n" +
                "(2161220315, 21612203, 504, 401, 8),\n" +
                "(2161220316, 21612203, 504, 401, 7),\n" +
                "(2161220317, 21612203, 504, 402, 8),\n" +
                "(2161220318, 21612203, 504, 403, 6),\n" +
                "(2161220319, 21612203, 504, 404, 9),\n" +
                "(2161220320, 21612203, 505, 401, 6),\n" +
                "(2161220321, 21612203, 505, 401, 5),\n" +
                "(2161220322, 21612203, 505, 402, 7),\n" +
                "(2161220323, 21612203, 505, 403, 8),\n" +
                "(2161220324, 21612203, 505, 404, 9);");
        db.execSQL(create_table_hocsinh);
        db.execSQL(create_table_lop);
        db.execSQL(insert_hocsinh);
        db.execSQL(insert_lop);
        db.execSQL(create_table_loaidiem);
        db.execSQL(insert_loaidiem);
        db.execSQL(create_table_monhoc);
        db.execSQL(insert_monhoc);
        db.execSQL(create_table_ketquahoctap);
        db.execSQL(insert_ketquahoctap);
        db.execSQL(create_table_chitietketqua);
        db.execSQL(insert_chitietketqua);

    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int i, int i1) {
        String drop_hocsinh = String.format("DROP TABLE IF EXISTS `hocsinh`;");
        String drop_lop = String.format("DROP TABLE IF EXISTS `lop`;");
        db.execSQL(drop_hocsinh);
        db.execSQL(drop_lop);
    }

    public boolean insertHocSinh(String mshs, String hotenhs, String gioitinh, String ngaysinh, String diachi, String email, String malop) {
        SQLiteDatabase db = this.getWritableDatabase();
        ContentValues contentValues = new ContentValues();
        contentValues.put(MSHS, mshs);
        contentValues.put(HoTenHS, hotenhs);
        contentValues.put(GioiTinh, gioitinh);
        contentValues.put(NgaySinh, ngaysinh);
        contentValues.put(DiaChi, diachi);
        contentValues.put(Email, email);
        contentValues.put(Malop, malop);
        long result = db.insert(hocsinh, null, contentValues);
        if (result == -1)
            return false;
        else
            return true;
    }

    public boolean insertLop(String malop, String tenlop, String siso, String namhoc) {
        SQLiteDatabase db = this.getWritableDatabase();
        ContentValues contentValues = new ContentValues();
        contentValues.put(Malop, malop);
        contentValues.put(TenLop, tenlop);
        contentValues.put(SiSo, siso);
        contentValues.put(NamHoc, namhoc);

        long result = db.insert(lop, null, contentValues);
        if (result == -1)
            return false;
        else
            return true;
    }

    public boolean insertLoaiDiem(String maloaidiem, String tenloaidiem) {
        SQLiteDatabase db = this.getWritableDatabase();
        ContentValues contentValues = new ContentValues();
        contentValues.put(MaLoaiDiem, maloaidiem);
        contentValues.put(TenLoaiDiem, tenloaidiem);


        long result = db.insert(loaidiem, null, contentValues);
        if (result == -1)
            return false;
        else
            return true;
    }

    public boolean insertMonHoc(String mamonhoc, String tenmonhoc) {
        SQLiteDatabase db = this.getWritableDatabase();
        ContentValues contentValues = new ContentValues();
        contentValues.put(MaMonHoc, mamonhoc);
        contentValues.put(TenMonHoc, tenmonhoc);


        long result = db.insert(monhoc, null, contentValues);
        if (result == -1)
            return false;
        else
            return true;
    }

    public boolean insertketquahoctap(String makqht, String mshs, String hocky, String namhoc, String tbcacmon) {
        SQLiteDatabase db = this.getWritableDatabase();
        ContentValues contentValues = new ContentValues();
        contentValues.put(MaKQHT, makqht);
        contentValues.put(MSHS, mshs);
        contentValues.put(HocKy, hocky);
        contentValues.put(NamHoc, namhoc);
        contentValues.put(TBCacMon, tbcacmon);

        long result = db.insert(ketquahoctap, null, contentValues);
        if (result == -1)
            return false;
        else
            return true;
    }
    public boolean insertchitietketqua(String mactkq, String makqht, String mamonhoc, String maloaidiem, String diemso) {
        SQLiteDatabase db = this.getWritableDatabase();
        ContentValues contentValues = new ContentValues();
        contentValues.put(MaCTKQ, mactkq);
        contentValues.put(MaKQHT, makqht);
        contentValues.put(MaMonHoc, mamonhoc);
        contentValues.put(MaLoaiDiem, maloaidiem);
        contentValues.put(DiemSo, diemso);

        long result = db.insert(chitietketqua, null, contentValues);
        if (result == -1)
            return false;
        else
            return true;
    }
}

